-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: May 01, 2026 at 11:36 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `for_my_love`
--

-- --------------------------------------------------------

--
-- Table structure for table `gallery`
--

CREATE TABLE `gallery` (
  `id` int(11) NOT NULL,
  `image_path` varchar(255) NOT NULL,
  `caption` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `gallery`
--

INSERT INTO `gallery` (`id`, `image_path`, `caption`, `created_at`) VALUES
(1, 'img/ชะอำ/1.jpg', 'ทริปชะอำของเรา 🌊', '2026-04-30 22:01:47'),
(2, 'img/ชะอำ/2.jpg', 'ทริปชะอำของเรา 🌊', '2026-04-30 22:01:47'),
(3, 'img/ชะอำ/3.jpg', 'ทริปชะอำของเรา 🌊', '2026-04-30 22:01:47'),
(4, 'img/ชะอำ/4.jpg', 'ทริปชะอำของเรา 🌊', '2026-04-30 22:01:47'),
(5, 'img/ชะอำ/5.jpg', 'ทริปชะอำของเรา 🌊', '2026-04-30 22:01:47'),
(6, 'img/ชะอำ/6.jpg', 'ทริปชะอำของเรา 🌊', '2026-04-30 22:01:47'),
(7, 'img/ชะอำ/7.jpg', 'ทริปชะอำของเรา 🌊', '2026-04-30 22:01:47'),
(8, 'img/ชะอำ/8.jpg', 'ทริปชะอำของเรา 🌊', '2026-04-30 22:01:47'),
(9, 'img/ชะอำ/9.jpg', 'ทริปชะอำของเรา 🌊', '2026-04-30 22:01:47'),
(10, 'img/ชะอำ/10.jpg', 'ทริปชะอำของเรา 🌊', '2026-04-30 22:01:47'),
(11, 'img/ชะอำ/11.jpg', 'ทริปชะอำของเรา 🌊', '2026-04-30 22:01:47'),
(12, 'img/ชะอำ/12.jpg', 'ทริปชะอำของเรา 🌊', '2026-04-30 22:01:47'),
(13, 'img/ชะอำ/13.jpg', 'ทริปชะอำของเรา 🌊', '2026-04-30 22:01:47'),
(14, 'img/ชะอำ/14.jpg', 'ทริปชะอำของเรา 🌊', '2026-04-30 22:01:47'),
(15, 'img/ชะอำ/15.jpg', 'ทริปชะอำของเรา 🌊', '2026-04-30 22:01:47'),
(16, 'img/ชะอำ/16.jpg', 'ทริปชะอำของเรา 🌊', '2026-04-30 22:01:47'),
(17, 'img/ชะอำ/17.jpg', 'ทริปชะอำของเรา 🌊', '2026-04-30 22:01:47'),
(18, 'img/ชะอำ/18.jpg', 'ทริปชะอำของเรา 🌊', '2026-04-30 22:01:47'),
(19, 'img/ชะอำ/19.jpg', 'ทริปชะอำของเรา 🌊', '2026-04-30 22:01:47'),
(20, 'img/ชะอำ/20.jpg', 'ทริปชะอำของเรา 🌊', '2026-04-30 22:01:47'),
(21, 'img/ชะอำ/21.jpg', 'ทริปชะอำของเรา 🌊', '2026-04-30 22:01:47'),
(22, 'img/งานวัดอุทยานเฉลิมกาญจนาภิเษก/1.jpg', 'งานวัดอุทยานเฉลิมกาญจนาภิเษก 🎡', '2026-04-30 22:11:44'),
(23, 'img/งานวัดอุทยานเฉลิมกาญจนาภิเษก/2.jpg', 'งานวัดอุทยานเฉลิมกาญจนาภิเษก 🎡', '2026-04-30 22:11:44'),
(24, 'img/งานวัดอุทยานเฉลิมกาญจนาภิเษก/3.jpg', 'งานวัดอุทยานเฉลิมกาญจนาภิเษก 🎡', '2026-04-30 22:11:44'),
(25, 'img/งานวัดอุทยานเฉลิมกาญจนาภิเษก/4.jpg', 'งานวัดอุทยานเฉลิมกาญจนาภิเษก 🎡', '2026-04-30 22:11:44'),
(26, 'img/งานวัดอุทยานเฉลิมกาญจนาภิเษก/5.jpg', 'งานวัดอุทยานเฉลิมกาญจนาภิเษก 🎡', '2026-04-30 22:11:44'),
(27, 'img/งานวัดอุทยานเฉลิมกาญจนาภิเษก/6.jpg', 'งานวัดอุทยานเฉลิมกาญจนาภิเษก 🎡', '2026-04-30 22:11:44'),
(28, 'img/งานวัดอุทยานเฉลิมกาญจนาภิเษก/7.jpg', 'งานวัดอุทยานเฉลิมกาญจนาภิเษก 🎡', '2026-04-30 22:11:44'),
(29, 'img/งานวัดอุทยานเฉลิมกาญจนาภิเษก/8.jpg', 'งานวัดอุทยานเฉลิมกาญจนาภิเษก 🎡', '2026-04-30 22:11:44'),
(30, 'img/งานวัดอุทยานเฉลิมกาญจนาภิเษก/9.jpg', 'งานวัดอุทยานเฉลิมกาญจนาภิเษก 🎡', '2026-04-30 22:11:44'),
(31, 'img/งานวัดอุทยานเฉลิมกาญจนาภิเษก/10.jpg', 'งานวัดอุทยานเฉลิมกาญจนาภิเษก 🎡', '2026-04-30 22:11:44'),
(32, 'img/งานวัดอุทยานเฉลิมกาญจนาภิเษก/11.jpg', 'งานวัดอุทยานเฉลิมกาญจนาภิเษก 🎡', '2026-04-30 22:11:44'),
(33, 'img/งานวัดอุทยานเฉลิมกาญจนาภิเษก/12.jpg', 'งานวัดอุทยานเฉลิมกาญจนาภิเษก 🎡', '2026-04-30 22:11:44'),
(34, 'img/งานวัดอุทยานเฉลิมกาญจนาภิเษก/13.jpg', 'งานวัดอุทยานเฉลิมกาญจนาภิเษก 🎡', '2026-04-30 22:11:44'),
(36, 'img/ลอยกระทง วันที่เราเป็นแฟนกัน/2.jpg', 'ลอยกระทง วันที่เราเป็นแฟนกัน ❤️', '2026-05-01 08:46:01'),
(37, 'img/ลอยกระทง วันที่เราเป็นแฟนกัน/3.jpg', 'ลอยกระทง วันที่เราเป็นแฟนกัน ❤️', '2026-05-01 08:46:01'),
(38, 'img/ลอยกระทง วันที่เราเป็นแฟนกัน/4.jpg', 'ลอยกระทง วันที่เราเป็นแฟนกัน ❤️', '2026-05-01 08:46:01'),
(39, 'img/ลอยกระทง วันที่เราเป็นแฟนกัน/5.jpg', 'ลอยกระทง วันที่เราเป็นแฟนกัน ❤️', '2026-05-01 08:46:01'),
(40, 'img/ลอยกระทง วันที่เราเป็นแฟนกัน/6.jpg', 'ลอยกระทง วันที่เราเป็นแฟนกัน ❤️', '2026-05-01 08:46:01'),
(41, 'img/ลอยกระทง วันที่เราเป็นแฟนกัน/7.jpg', 'ลอยกระทง วันที่เราเป็นแฟนกัน ❤️', '2026-05-01 08:46:01'),
(42, 'img/ลอยกระทง วันที่เราเป็นแฟนกัน/262.jpg', 'ลอยกระทง วันที่เราเป็นแฟนกัน ❤️', '2026-05-01 08:48:30'),
(43, 'img/วันครบรอบเดือนแรกของเรา/1.jpg', 'วันครบรอบเดือนแรกของเรา ❤️', '2026-05-01 08:52:43'),
(44, 'img/วันครบรอบเดือนแรกของเรา/2.jpg', 'วันครบรอบเดือนแรกของเรา ❤️', '2026-05-01 08:52:43'),
(45, 'img/วันครบรอบเดือนแรกของเรา/3.jpg', 'วันครบรอบเดือนแรกของเรา ❤️', '2026-05-01 08:52:43'),
(46, 'img/วันครบรอบเดือนแรกของเรา/4.jpg', 'วันครบรอบเดือนแรกของเรา ❤️', '2026-05-01 08:52:43'),
(47, 'img/วันครบรอบเดือนแรกของเรา/5.jpg', 'วันครบรอบเดือนแรกของเรา ❤️', '2026-05-01 08:52:43'),
(48, 'img/วันครบรอบเดือนแรกของเรา/6.jpg', 'วันครบรอบเดือนแรกของเรา ❤️', '2026-05-01 08:52:43'),
(49, 'img/วันครบรอบเดือนแรกของเรา/7.jpg', 'วันครบรอบเดือนแรกของเรา ❤️', '2026-05-01 08:52:43'),
(50, 'img/วันครบรอบเดือนแรกของเรา/8.jpg', 'วันครบรอบเดือนแรกของเรา ❤️', '2026-05-01 08:52:43'),
(51, 'img/ทริปบางแสน/1.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(52, 'img/ทริปบางแสน/2.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(53, 'img/ทริปบางแสน/3.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(54, 'img/ทริปบางแสน/4.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(55, 'img/ทริปบางแสน/5.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(56, 'img/ทริปบางแสน/6.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(57, 'img/ทริปบางแสน/7.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(58, 'img/ทริปบางแสน/8.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(59, 'img/ทริปบางแสน/9.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(60, 'img/ทริปบางแสน/10.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(61, 'img/ทริปบางแสน/11.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(62, 'img/ทริปบางแสน/12.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(63, 'img/ทริปบางแสน/13.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(64, 'img/ทริปบางแสน/14.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(65, 'img/ทริปบางแสน/15.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(66, 'img/ทริปบางแสน/16.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(67, 'img/ทริปบางแสน/17.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(68, 'img/ทริปบางแสน/18.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(69, 'img/ทริปบางแสน/19.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(70, 'img/ทริปบางแสน/20.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(71, 'img/ทริปบางแสน/21.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(72, 'img/ทริปบางแสน/22.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(73, 'img/ทริปบางแสน/23.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(74, 'img/ทริปบางแสน/24.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(75, 'img/ทริปบางแสน/25.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(76, 'img/ทริปบางแสน/26.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(77, 'img/ทริปบางแสน/27.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(78, 'img/ทริปบางแสน/28.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(79, 'img/ทริปบางแสน/29.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(80, 'img/ทริปบางแสน/30.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(81, 'img/ทริปบางแสน/31.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(82, 'img/ทริปบางแสน/32.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(83, 'img/ทริปบางแสน/33.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(84, 'img/ทริปบางแสน/34.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(85, 'img/ทริปบางแสน/35.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(86, 'img/ทริปบางแสน/36.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(87, 'img/ทริปบางแสน/37.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(88, 'img/ทริปบางแสน/38.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(89, 'img/ทริปบางแสน/39.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(90, 'img/ทริปบางแสน/40.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32'),
(91, 'img/ทริปบางแสน/41.jpg', 'ทริปบางแสน 🏖️', '2026-05-01 09:00:32');

-- --------------------------------------------------------

--
-- Table structure for table `music`
--

CREATE TABLE `music` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `artist` varchar(255) DEFAULT NULL,
  `file_path` varchar(255) NOT NULL,
  `cover_image` varchar(255) DEFAULT NULL,
  `lyrics` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `music`
--

INSERT INTO `music` (`id`, `title`, `artist`, `file_path`, `cover_image`, `lyrics`, `created_at`) VALUES
(1, 'Something Stupid', 'Lola Marsh', 'music/Something Stupid.mp3', 'img/cover_image/our_hat_photo.jpg', 'เวลาได้ฟัง Something Stupid\nมันไม่ใช่แค่เพลงรักธรรมดา\nแต่มันเหมือนเป็นช่วงเวลานึงของภู\nที่เคยมีจี้อยู่ในนั้น\n\nเป็นช่วงที่อยากพูดความรู้สึกออกไป\nแต่ก็กลัวว่ามันจะเร็วเกินไป\nกลัวว่าถ้าพูดไป…ทุกอย่างอาจเปลี่ยน\n\nภูเลยเลือกเก็บมันไว้\nเก็บความรู้สึกเล็กๆนั้นไว้เงียบๆ\nแล้วก็แค่ยืนอยู่ข้างๆคุณในฐานะเพื่อน\n\nทุกครั้งที่เพลงนี้ดังขึ้น\nมันเลยพาภูย้อนกลับไป\nตอนที่ภูยังไม่มีจี้…แต่ก็มีจี้อยู่ในใจตลอด\n\nและมันยิ่งมีความหมายมากขึ้น\nเพราะวันนี้\nภูไม่ต้องแอบรู้สึกอีกแล้ว', '2026-04-30 21:19:42'),
(3, 'A Thousand Years', 'Christina Perri\n', 'music/A Thousand Years.mp3', 'img/cover_image/our_hat_photo2.jpg', 'ภูรู้ว่าจี้ชอบเพลง A Thousand Years\nเพลงที่บอกว่ารักใครสักคนได้ยาวนานเป็นพันปี\n\nแต่สำหรับภู\nถ้าได้รักจี้จริงๆแล้ว\n\nพันปีมันอาจจะยังน้อยไปด้วยซ้ำ\n\nเพราะทุกวันที่มีจี้อยู่ข้างๆ\nมันทำให้ภูรู้ว่า\n\nภูไม่ได้แค่อยากรักคุณนานๆ\nแต่ภูอยากรักจี้…ตลอดไป 🤍', '2026-04-30 21:30:16');

-- --------------------------------------------------------

--
-- Table structure for table `settings`
--

CREATE TABLE `settings` (
  `id` int(11) NOT NULL,
  `anniversary_date` date NOT NULL,
  `passcode` varchar(6) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `settings`
--

INSERT INTO `settings` (`id`, `anniversary_date`, `passcode`) VALUES
(1, '2025-11-05', '051125');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `gallery`
--
ALTER TABLE `gallery`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `music`
--
ALTER TABLE `music`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `settings`
--
ALTER TABLE `settings`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `gallery`
--
ALTER TABLE `gallery`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=92;

--
-- AUTO_INCREMENT for table `music`
--
ALTER TABLE `music`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `settings`
--
ALTER TABLE `settings`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
